zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_MSCM.h
/*
 * Copyright 1997-2016 Freescale Semiconductor, Inc.
 * Copyright 2016-2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/*!
 * @file S32K566_MSCM.h
 * @version 2.2
 * @date 2025-10-16
 * @brief Peripheral Access Layer for S32K566_MSCM
 *
 * This file contains register definitions and macros for easy access to their
 * bit fields.
 *
 * This file assumes LITTLE endian system.
 */

/**
* @page misra_violations MISRA-C:2012 violations
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.3, local typedef not referenced
* The SoC header defines typedef for all modules.
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.5, local macro not referenced
* The SoC header defines macros for all modules and registers.
*
* @section [global]
* Violates MISRA 2012 Advisory Directive 4.9, Function-like macro
* These are generated macros used for accessing the bit-fields from registers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.1, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.2, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.4, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.5, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 21.1, defined macro '__I' is reserved to the compiler
* This type qualifier is needed to ensure correct I/O access and addressing.
*/

/* Prevention from multiple including the same memory map */
#if !defined(S32K566_MSCM_H_)  /* Check if memory map has not been already included */
#define S32K566_MSCM_H_

#include "S32K566_COMMON.h"

/* ----------------------------------------------------------------------------
   -- MSCM Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup MSCM_Peripheral_Access_Layer MSCM Peripheral Access Layer
 * @{
 */

/** MSCM - Size of Registers Arrays */
#define MSCM_IRSPRC_CM_DSPV_COUNT                 240u
#define MSCM_IRSPRC_CPE_COUNT                     329u

/** MSCM - Register Layout Typedef */
typedef struct MSCM_Struct {
  __I  uint32_t CPXTYPE;                           /**< Processor X Type, offset: 0x0 */
  __I  uint32_t CPXNUM;                            /**< Processor X Number, offset: 0x4 */
  __I  uint32_t CPXREV;                            /**< Processor X Revision, offset: 0x8 */
  __I  uint32_t CPXCFG0;                           /**< Processor X Configuration 0, offset: 0xC */
  __I  uint32_t CPXCFG1;                           /**< Processor X Configuration 1, offset: 0x10 */
  __I  uint32_t CPXCFG2;                           /**< Processor X Configuration 2, offset: 0x14 */
  __I  uint32_t CPXCFG3;                           /**< Processor X Configuration 3, offset: 0x18 */
  uint8_t RESERVED_0[4];
  __I  uint32_t CP0TYPE;                           /**< Processor 0 Type, offset: 0x20 */
  __I  uint32_t CP0NUM;                            /**< Processor 0 Number, offset: 0x24 */
  __I  uint32_t CP0REV;                            /**< Processor 0 Count, offset: 0x28 */
  __I  uint32_t CP0CFG0;                           /**< Processor 0 Configuration 0, offset: 0x2C */
  __I  uint32_t CP0CFG1;                           /**< Processor 0 Configuration 1, offset: 0x30 */
  __I  uint32_t CP0CFG2;                           /**< Processor 0 Configuration 2, offset: 0x34 */
  __I  uint32_t CP0CFG3;                           /**< Processor 0 Configuration 3, offset: 0x38 */
  uint8_t RESERVED_1[4];
  __I  uint32_t CP1TYPE;                           /**< Processor 1 Type, offset: 0x40 */
  __I  uint32_t CP1NUM;                            /**< Processor 1 Number, offset: 0x44 */
  __I  uint32_t CP1REV;                            /**< Processor 1 Count, offset: 0x48 */
  __I  uint32_t CP1CFG0;                           /**< Processor 1 Configuration 0, offset: 0x4C */
  __I  uint32_t CP1CFG1;                           /**< Processor 1 Configuration 1, offset: 0x50 */
  __I  uint32_t CP1CFG2;                           /**< Processor 1 Configuration 2, offset: 0x54 */
  __I  uint32_t CP1CFG3;                           /**< Processor 1 Configuration 3, offset: 0x58 */
  uint8_t RESERVED_2[4];
  __I  uint32_t CP2TYPE;                           /**< Processor 2 Type, offset: 0x60 */
  __I  uint32_t CP2NUM;                            /**< Processor 2 Number, offset: 0x64 */
  __I  uint32_t CP2REV;                            /**< Processor 2 Count, offset: 0x68 */
  __I  uint32_t CP2CFG0;                           /**< Processor 2 Configuration 0, offset: 0x6C */
  __I  uint32_t CP2CFG1;                           /**< Processor 2 Configuration 1, offset: 0x70 */
  __I  uint32_t CP2CFG2;                           /**< Processor 2 Configuration 2, offset: 0x74 */
  __I  uint32_t CP2CFG3;                           /**< Processor 2 Configuration 3, offset: 0x78 */
  uint8_t RESERVED_3[4];
  __I  uint32_t CP3TYPE;                           /**< Processor 3 Type, offset: 0x80 */
  __I  uint32_t CP3NUM;                            /**< Processor 3 Number, offset: 0x84 */
  __I  uint32_t CP3REV;                            /**< Processor 3 Count, offset: 0x88 */
  __I  uint32_t CP3CFG0;                           /**< Processor 3 Configuration 0, offset: 0x8C */
  __I  uint32_t CP3CFG1;                           /**< Processor 3 Configuration 1, offset: 0x90 */
  __I  uint32_t CP3CFG2;                           /**< Processor 3 Configuration 2, offset: 0x94 */
  __I  uint32_t CP3CFG3;                           /**< Processor 3 Configuration 3, offset: 0x98 */
  uint8_t RESERVED_4[4];
  __I  uint32_t LPE_CORE_TYPE;                     /**< LPE Core Type, offset: 0xA0 */
  __I  uint32_t LPE_CORE_NUM;                      /**< LPE Core Number, offset: 0xA4 */
  __I  uint32_t LPE_CORE_REV;                      /**< LPE Core Count, offset: 0xA8 */
  __I  uint32_t LPE_CORE_CFG0;                     /**< LPE Core Configuration 0, offset: 0xAC */
  __I  uint32_t LPE_CORE_CFG1;                     /**< LPE Core Configuration 1, offset: 0xB0 */
  __I  uint32_t LPE_CORE_CFG2;                     /**< LPE Core Configuration 2, offset: 0xB4 */
  __I  uint32_t LPE_CORE_CFG3;                     /**< LPE Core Configuration 3, offset: 0xB8 */
  uint8_t RESERVED_5[4];
  __I  uint32_t DSPV_TYPE;                         /**< DSPV Type, offset: 0xC0 */
  __I  uint32_t DSPV_NUM;                          /**< DSPV Number, offset: 0xC4 */
  __I  uint32_t DSPV_REV;                          /**< DSPV Count, offset: 0xC8 */
  __I  uint32_t DSPV_CFG0;                         /**< DSPV Configuration 0, offset: 0xCC */
  __I  uint32_t DSPV_CFG1;                         /**< DSPV Configuration 1, offset: 0xD0 */
  __I  uint32_t DSPV_CFG2;                         /**< DSPV Configuration 2, offset: 0xD4 */
  __I  uint32_t DSPV_CFG3;                         /**< DSPV Configuration 3, offset: 0xD8 */
  uint8_t RESERVED_6[4];
  __I  uint32_t CPE_CORE_TYPE;                     /**< CPE Core Type, offset: 0xE0 */
  __I  uint32_t CPE_CORE_NUM;                      /**< CPE Core Number, offset: 0xE4 */
  __I  uint32_t CPE_CORE_REV;                      /**< CPE Core Count, offset: 0xE8 */
  __I  uint32_t CPE_CORE_CFG0;                     /**< CPE Core Configuration 0, offset: 0xEC */
  __I  uint32_t CPE_CORE_CFG1;                     /**< CPE Core Configuration 1, offset: 0xF0 */
  __I  uint32_t CPE_CORE_CFG2;                     /**< CPE Core Configuration 2, offset: 0xF4 */
  __I  uint32_t CPE_CORE_CFG3;                     /**< CPE Core Configuration 3, offset: 0xF8 */
  uint8_t RESERVED_7[1028];
  __IO uint32_t XN_CTRL0;                          /**< Memory Execution Control 0, offset: 0x500 */
  __IO uint32_t XN_CTRL1;                          /**< Memory Execution Control 1, offset: 0x504 */
  uint8_t RESERVED_8[8];
  __IO uint32_t PLAT_NMI_CONTROL;                  /**< Platform NMI Control, offset: 0x510 */
  __IO uint32_t LPE_NMI_CONTROL;                   /**< LPE NMI Control, offset: 0x514 */
  __IO uint32_t CPE_NMI_CONTROL;                   /**< CPE NMI Control, offset: 0x518 */
  uint8_t RESERVED_9[228];
  __IO uint32_t ENEDC;                             /**< Enable Interconnect Error Detection, offset: 0x600 */
  __IO uint32_t ENEDC1;                            /**< Enable Interconnect Error Detection, offset: 0x604 */
  uint8_t RESERVED_10[248];
  __IO uint32_t IAHBCFGREG;                        /**< AHB Gasket Configuration, offset: 0x700 */
  uint8_t RESERVED_11[380];
  __IO uint16_t IRSPRC_CM_DSPV[MSCM_IRSPRC_CM_DSPV_COUNT]; /**< Interrupt Router Shared Peripheral Control for the Cortex-M7, Cortex-M4, and DSPV Cores, array offset: 0x880, array step: 0x2 */
  __IO uint16_t IRSPRC_CPE[MSCM_IRSPRC_CPE_COUNT]; /**< Interrupt Router Shared Peripheral Routing Control for CPE Cores, array offset: 0xA60, array step: 0x2 */
} MSCM_Type, *MSCM_MemMapPtr;

/** Number of instances of the MSCM module. */
#define MSCM_INSTANCE_COUNT                      (1u)

/* MSCM - Peripheral instance base addresses */
/** Peripheral MSCM base address */
#define IP_MSCM_BASE                             (0x40494000u)
/** Peripheral MSCM base pointer */
#define IP_MSCM                                  ((MSCM_Type *)IP_MSCM_BASE)
/** Array initializer of MSCM peripheral base addresses */
#define IP_MSCM_BASE_ADDRS                       { IP_MSCM_BASE }
/** Array initializer of MSCM peripheral base pointers */
#define IP_MSCM_BASE_PTRS                        { IP_MSCM }

/* ----------------------------------------------------------------------------
   -- MSCM Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup MSCM_Register_Masks MSCM Register Masks
 * @{
 */

/*! @name CPXTYPE - Processor X Type */
/*! @{ */

