zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_MSCM.h
#define MSCM_DSPV_CFG1_L2WY_MASK                 (0xFF0000U)
#define MSCM_DSPV_CFG1_L2WY_SHIFT                (16U)
#define MSCM_DSPV_CFG1_L2WY_WIDTH                (8U)
#define MSCM_DSPV_CFG1_L2WY(x)                   (((uint32_t)(((uint32_t)(x)) << MSCM_DSPV_CFG1_L2WY_SHIFT)) & MSCM_DSPV_CFG1_L2WY_MASK)

#define MSCM_DSPV_CFG1_L2SZ_MASK                 (0xFF000000U)
#define MSCM_DSPV_CFG1_L2SZ_SHIFT                (24U)
#define MSCM_DSPV_CFG1_L2SZ_WIDTH                (8U)
#define MSCM_DSPV_CFG1_L2SZ(x)                   (((uint32_t)(((uint32_t)(x)) << MSCM_DSPV_CFG1_L2SZ_SHIFT)) & MSCM_DSPV_CFG1_L2SZ_MASK)
/*! @} */

/*! @name DSPV_CFG2 - DSPV Configuration 2 */
/*! @{ */

#define MSCM_DSPV_CFG2_ITCMSZ_MASK               (0xFF0000U)
#define MSCM_DSPV_CFG2_ITCMSZ_SHIFT              (16U)
#define MSCM_DSPV_CFG2_ITCMSZ_WIDTH              (8U)
#define MSCM_DSPV_CFG2_ITCMSZ(x)                 (((uint32_t)(((uint32_t)(x)) << MSCM_DSPV_CFG2_ITCMSZ_SHIFT)) & MSCM_DSPV_CFG2_ITCMSZ_MASK)

#define MSCM_DSPV_CFG2_DTCMSZ_MASK               (0xFF000000U)
#define MSCM_DSPV_CFG2_DTCMSZ_SHIFT              (24U)
#define MSCM_DSPV_CFG2_DTCMSZ_WIDTH              (8U)
#define MSCM_DSPV_CFG2_DTCMSZ(x)                 (((uint32_t)(((uint32_t)(x)) << MSCM_DSPV_CFG2_DTCMSZ_SHIFT)) & MSCM_DSPV_CFG2_DTCMSZ_MASK)
/*! @} */

/*! @name DSPV_CFG3 - DSPV Configuration 3 */
/*! @{ */

#define MSCM_DSPV_CFG3_FPU_MASK                  (0x1U)
#define MSCM_DSPV_CFG3_FPU_SHIFT                 (0U)
#define MSCM_DSPV_CFG3_FPU_WIDTH                 (1U)
#define MSCM_DSPV_CFG3_FPU(x)                    (((uint32_t)(((uint32_t)(x)) << MSCM_DSPV_CFG3_FPU_SHIFT)) & MSCM_DSPV_CFG3_FPU_MASK)

#define MSCM_DSPV_CFG3_SIMD_MASK                 (0x2U)
#define MSCM_DSPV_CFG3_SIMD_SHIFT                (1U)
#define MSCM_DSPV_CFG3_SIMD_WIDTH                (1U)
#define MSCM_DSPV_CFG3_SIMD(x)                   (((uint32_t)(((uint32_t)(x)) << MSCM_DSPV_CFG3_SIMD_SHIFT)) & MSCM_DSPV_CFG3_SIMD_MASK)

#define MSCM_DSPV_CFG3_MMU_MASK                  (0x4U)
#define MSCM_DSPV_CFG3_MMU_SHIFT                 (2U)
#define MSCM_DSPV_CFG3_MMU_WIDTH                 (1U)
#define MSCM_DSPV_CFG3_MMU(x)                    (((uint32_t)(((uint32_t)(x)) << MSCM_DSPV_CFG3_MMU_SHIFT)) & MSCM_DSPV_CFG3_MMU_MASK)

#define MSCM_DSPV_CFG3_CMP_MASK                  (0x8U)
#define MSCM_DSPV_CFG3_CMP_SHIFT                 (3U)
#define MSCM_DSPV_CFG3_CMP_WIDTH                 (1U)
#define MSCM_DSPV_CFG3_CMP(x)                    (((uint32_t)(((uint32_t)(x)) << MSCM_DSPV_CFG3_CMP_SHIFT)) & MSCM_DSPV_CFG3_CMP_MASK)

#define MSCM_DSPV_CFG3_CPY_MASK                  (0x10U)
#define MSCM_DSPV_CFG3_CPY_SHIFT                 (4U)
#define MSCM_DSPV_CFG3_CPY_WIDTH                 (1U)
#define MSCM_DSPV_CFG3_CPY(x)                    (((uint32_t)(((uint32_t)(x)) << MSCM_DSPV_CFG3_CPY_SHIFT)) & MSCM_DSPV_CFG3_CPY_MASK)
/*! @} */

/*! @name CPE_CORE_TYPE - CPE Core Type */
/*! @{ */

#define MSCM_CPE_CORE_TYPE_PERSONALITY_MASK      (0xFFFFFFFFU)
#define MSCM_CPE_CORE_TYPE_PERSONALITY_SHIFT     (0U)
#define MSCM_CPE_CORE_TYPE_PERSONALITY_WIDTH     (32U)
#define MSCM_CPE_CORE_TYPE_PERSONALITY(x)        (((uint32_t)(((uint32_t)(x)) << MSCM_CPE_CORE_TYPE_PERSONALITY_SHIFT)) & MSCM_CPE_CORE_TYPE_PERSONALITY_MASK)
/*! @} */

/*! @name CPE_CORE_NUM - CPE Core Number */
/*! @{ */

#define MSCM_CPE_CORE_NUM_CPN_MASK               (0x3U)
#define MSCM_CPE_CORE_NUM_CPN_SHIFT              (0U)
#define MSCM_CPE_CORE_NUM_CPN_WIDTH              (2U)
#define MSCM_CPE_CORE_NUM_CPN(x)                 (((uint32_t)(((uint32_t)(x)) << MSCM_CPE_CORE_NUM_CPN_SHIFT)) & MSCM_CPE_CORE_NUM_CPN_MASK)
/*! @} */

/*! @name CPE_CORE_REV - CPE Core Count */
/*! @{ */

#define MSCM_CPE_CORE_REV_RYPZ_MASK              (0xFFU)
#define MSCM_CPE_CORE_REV_RYPZ_SHIFT             (0U)
#define MSCM_CPE_CORE_REV_RYPZ_WIDTH             (8U)
#define MSCM_CPE_CORE_REV_RYPZ(x)                (((uint32_t)(((uint32_t)(x)) << MSCM_CPE_CORE_REV_RYPZ_SHIFT)) & MSCM_CPE_CORE_REV_RYPZ_MASK)
/*! @} */

/*! @name CPE_CORE_CFG0 - CPE Core Configuration 0 */
/*! @{ */

#define MSCM_CPE_CORE_CFG0_DCWY_MASK             (0xFFU)
#define MSCM_CPE_CORE_CFG0_DCWY_SHIFT            (0U)
#define MSCM_CPE_CORE_CFG0_DCWY_WIDTH            (8U)
#define MSCM_CPE_CORE_CFG0_DCWY(x)               (((uint32_t)(((uint32_t)(x)) << MSCM_CPE_CORE_CFG0_DCWY_SHIFT)) & MSCM_CPE_CORE_CFG0_DCWY_MASK)

#define MSCM_CPE_CORE_CFG0_DCSZ_MASK             (0xFF00U)
#define MSCM_CPE_CORE_CFG0_DCSZ_SHIFT            (8U)
#define MSCM_CPE_CORE_CFG0_DCSZ_WIDTH            (8U)
#define MSCM_CPE_CORE_CFG0_DCSZ(x)               (((uint32_t)(((uint32_t)(x)) << MSCM_CPE_CORE_CFG0_DCSZ_SHIFT)) & MSCM_CPE_CORE_CFG0_DCSZ_MASK)

#define MSCM_CPE_CORE_CFG0_ICWY_MASK             (0xFF0000U)
#define MSCM_CPE_CORE_CFG0_ICWY_SHIFT            (16U)
#define MSCM_CPE_CORE_CFG0_ICWY_WIDTH            (8U)
#define MSCM_CPE_CORE_CFG0_ICWY(x)               (((uint32_t)(((uint32_t)(x)) << MSCM_CPE_CORE_CFG0_ICWY_SHIFT)) & MSCM_CPE_CORE_CFG0_ICWY_MASK)

#define MSCM_CPE_CORE_CFG0_ICSZ_MASK             (0xFF000000U)
#define MSCM_CPE_CORE_CFG0_ICSZ_SHIFT            (24U)
#define MSCM_CPE_CORE_CFG0_ICSZ_WIDTH            (8U)
#define MSCM_CPE_CORE_CFG0_ICSZ(x)               (((uint32_t)(((uint32_t)(x)) << MSCM_CPE_CORE_CFG0_ICSZ_SHIFT)) & MSCM_CPE_CORE_CFG0_ICSZ_MASK)
/*! @} */

/*! @name CPE_CORE_CFG1 - CPE Core Configuration 1 */
/*! @{ */

#define MSCM_CPE_CORE_CFG1_L2WY_MASK             (0xFF0000U)
#define MSCM_CPE_CORE_CFG1_L2WY_SHIFT            (16U)
#define MSCM_CPE_CORE_CFG1_L2WY_WIDTH            (8U)
#define MSCM_CPE_CORE_CFG1_L2WY(x)               (((uint32_t)(((uint32_t)(x)) << MSCM_CPE_CORE_CFG1_L2WY_SHIFT)) & MSCM_CPE_CORE_CFG1_L2WY_MASK)

#define MSCM_CPE_CORE_CFG1_L2SZ_MASK             (0xFF000000U)
#define MSCM_CPE_CORE_CFG1_L2SZ_SHIFT            (24U)
#define MSCM_CPE_CORE_CFG1_L2SZ_WIDTH            (8U)
#define MSCM_CPE_CORE_CFG1_L2SZ(x)               (((uint32_t)(((uint32_t)(x)) << MSCM_CPE_CORE_CFG1_L2SZ_SHIFT)) & MSCM_CPE_CORE_CFG1_L2SZ_MASK)
/*! @} */

