zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_MSCM.h
/*! @name CPE_CORE_CFG2 - CPE Core Configuration 2 */
/*! @{ */

#define MSCM_CPE_CORE_CFG2_ITCMSZ_MASK           (0xFF0000U)
#define MSCM_CPE_CORE_CFG2_ITCMSZ_SHIFT          (16U)
#define MSCM_CPE_CORE_CFG2_ITCMSZ_WIDTH          (8U)
#define MSCM_CPE_CORE_CFG2_ITCMSZ(x)             (((uint32_t)(((uint32_t)(x)) << MSCM_CPE_CORE_CFG2_ITCMSZ_SHIFT)) & MSCM_CPE_CORE_CFG2_ITCMSZ_MASK)

#define MSCM_CPE_CORE_CFG2_DTCMSZ_MASK           (0xFF000000U)
#define MSCM_CPE_CORE_CFG2_DTCMSZ_SHIFT          (24U)
#define MSCM_CPE_CORE_CFG2_DTCMSZ_WIDTH          (8U)
#define MSCM_CPE_CORE_CFG2_DTCMSZ(x)             (((uint32_t)(((uint32_t)(x)) << MSCM_CPE_CORE_CFG2_DTCMSZ_SHIFT)) & MSCM_CPE_CORE_CFG2_DTCMSZ_MASK)
/*! @} */

/*! @name CPE_CORE_CFG3 - CPE Core Configuration 3 */
/*! @{ */

#define MSCM_CPE_CORE_CFG3_FPU_MASK              (0x1U)
#define MSCM_CPE_CORE_CFG3_FPU_SHIFT             (0U)
#define MSCM_CPE_CORE_CFG3_FPU_WIDTH             (1U)
#define MSCM_CPE_CORE_CFG3_FPU(x)                (((uint32_t)(((uint32_t)(x)) << MSCM_CPE_CORE_CFG3_FPU_SHIFT)) & MSCM_CPE_CORE_CFG3_FPU_MASK)

#define MSCM_CPE_CORE_CFG3_SIMD_MASK             (0x2U)
#define MSCM_CPE_CORE_CFG3_SIMD_SHIFT            (1U)
#define MSCM_CPE_CORE_CFG3_SIMD_WIDTH            (1U)
#define MSCM_CPE_CORE_CFG3_SIMD(x)               (((uint32_t)(((uint32_t)(x)) << MSCM_CPE_CORE_CFG3_SIMD_SHIFT)) & MSCM_CPE_CORE_CFG3_SIMD_MASK)

#define MSCM_CPE_CORE_CFG3_MMU_MASK              (0x4U)
#define MSCM_CPE_CORE_CFG3_MMU_SHIFT             (2U)
#define MSCM_CPE_CORE_CFG3_MMU_WIDTH             (1U)
#define MSCM_CPE_CORE_CFG3_MMU(x)                (((uint32_t)(((uint32_t)(x)) << MSCM_CPE_CORE_CFG3_MMU_SHIFT)) & MSCM_CPE_CORE_CFG3_MMU_MASK)

#define MSCM_CPE_CORE_CFG3_CMP_MASK              (0x8U)
#define MSCM_CPE_CORE_CFG3_CMP_SHIFT             (3U)
#define MSCM_CPE_CORE_CFG3_CMP_WIDTH             (1U)
#define MSCM_CPE_CORE_CFG3_CMP(x)                (((uint32_t)(((uint32_t)(x)) << MSCM_CPE_CORE_CFG3_CMP_SHIFT)) & MSCM_CPE_CORE_CFG3_CMP_MASK)

#define MSCM_CPE_CORE_CFG3_CPY_MASK              (0x10U)
#define MSCM_CPE_CORE_CFG3_CPY_SHIFT             (4U)
#define MSCM_CPE_CORE_CFG3_CPY_WIDTH             (1U)
#define MSCM_CPE_CORE_CFG3_CPY(x)                (((uint32_t)(((uint32_t)(x)) << MSCM_CPE_CORE_CFG3_CPY_SHIFT)) & MSCM_CPE_CORE_CFG3_CPY_MASK)
/*! @} */

/*! @name XN_CTRL0 - Memory Execution Control 0 */
/*! @{ */

#define MSCM_XN_CTRL0_SRAM0_MASK                 (0x1U)
#define MSCM_XN_CTRL0_SRAM0_SHIFT                (0U)
#define MSCM_XN_CTRL0_SRAM0_WIDTH                (1U)
#define MSCM_XN_CTRL0_SRAM0(x)                   (((uint32_t)(((uint32_t)(x)) << MSCM_XN_CTRL0_SRAM0_SHIFT)) & MSCM_XN_CTRL0_SRAM0_MASK)

#define MSCM_XN_CTRL0_SRAM1_MASK                 (0x2U)
#define MSCM_XN_CTRL0_SRAM1_SHIFT                (1U)
#define MSCM_XN_CTRL0_SRAM1_WIDTH                (1U)
#define MSCM_XN_CTRL0_SRAM1(x)                   (((uint32_t)(((uint32_t)(x)) << MSCM_XN_CTRL0_SRAM1_SHIFT)) & MSCM_XN_CTRL0_SRAM1_MASK)

#define MSCM_XN_CTRL0_SRAM_2_MASK                (0x4U)
#define MSCM_XN_CTRL0_SRAM_2_SHIFT               (2U)
#define MSCM_XN_CTRL0_SRAM_2_WIDTH               (1U)
#define MSCM_XN_CTRL0_SRAM_2(x)                  (((uint32_t)(((uint32_t)(x)) << MSCM_XN_CTRL0_SRAM_2_SHIFT)) & MSCM_XN_CTRL0_SRAM_2_MASK)

#define MSCM_XN_CTRL0_CORE_0_DIS_ITCM_EXEC_MASK  (0x10U)
#define MSCM_XN_CTRL0_CORE_0_DIS_ITCM_EXEC_SHIFT (4U)
#define MSCM_XN_CTRL0_CORE_0_DIS_ITCM_EXEC_WIDTH (1U)
#define MSCM_XN_CTRL0_CORE_0_DIS_ITCM_EXEC(x)    (((uint32_t)(((uint32_t)(x)) << MSCM_XN_CTRL0_CORE_0_DIS_ITCM_EXEC_SHIFT)) & MSCM_XN_CTRL0_CORE_0_DIS_ITCM_EXEC_MASK)

#define MSCM_XN_CTRL0_CORE_1_DIS_ITCM_EXEC_MASK  (0x20U)
#define MSCM_XN_CTRL0_CORE_1_DIS_ITCM_EXEC_SHIFT (5U)
#define MSCM_XN_CTRL0_CORE_1_DIS_ITCM_EXEC_WIDTH (1U)
#define MSCM_XN_CTRL0_CORE_1_DIS_ITCM_EXEC(x)    (((uint32_t)(((uint32_t)(x)) << MSCM_XN_CTRL0_CORE_1_DIS_ITCM_EXEC_SHIFT)) & MSCM_XN_CTRL0_CORE_1_DIS_ITCM_EXEC_MASK)

#define MSCM_XN_CTRL0_CORE_2_DIS_ITCM_EXEC_MASK  (0x40U)
#define MSCM_XN_CTRL0_CORE_2_DIS_ITCM_EXEC_SHIFT (6U)
#define MSCM_XN_CTRL0_CORE_2_DIS_ITCM_EXEC_WIDTH (1U)
#define MSCM_XN_CTRL0_CORE_2_DIS_ITCM_EXEC(x)    (((uint32_t)(((uint32_t)(x)) << MSCM_XN_CTRL0_CORE_2_DIS_ITCM_EXEC_SHIFT)) & MSCM_XN_CTRL0_CORE_2_DIS_ITCM_EXEC_MASK)

#define MSCM_XN_CTRL0_CORE_3_DIS_ITCM_EXEC_MASK  (0x80U)
#define MSCM_XN_CTRL0_CORE_3_DIS_ITCM_EXEC_SHIFT (7U)
#define MSCM_XN_CTRL0_CORE_3_DIS_ITCM_EXEC_WIDTH (1U)
#define MSCM_XN_CTRL0_CORE_3_DIS_ITCM_EXEC(x)    (((uint32_t)(((uint32_t)(x)) << MSCM_XN_CTRL0_CORE_3_DIS_ITCM_EXEC_SHIFT)) & MSCM_XN_CTRL0_CORE_3_DIS_ITCM_EXEC_MASK)

#define MSCM_XN_CTRL0_CORE0_D0TCM_DIS_EXEC_MASK  (0x100U)
#define MSCM_XN_CTRL0_CORE0_D0TCM_DIS_EXEC_SHIFT (8U)
#define MSCM_XN_CTRL0_CORE0_D0TCM_DIS_EXEC_WIDTH (1U)
#define MSCM_XN_CTRL0_CORE0_D0TCM_DIS_EXEC(x)    (((uint32_t)(((uint32_t)(x)) << MSCM_XN_CTRL0_CORE0_D0TCM_DIS_EXEC_SHIFT)) & MSCM_XN_CTRL0_CORE0_D0TCM_DIS_EXEC_MASK)

#define MSCM_XN_CTRL0_CORE1_D0TCM_DIS_EXEC_MASK  (0x200U)
#define MSCM_XN_CTRL0_CORE1_D0TCM_DIS_EXEC_SHIFT (9U)
#define MSCM_XN_CTRL0_CORE1_D0TCM_DIS_EXEC_WIDTH (1U)
#define MSCM_XN_CTRL0_CORE1_D0TCM_DIS_EXEC(x)    (((uint32_t)(((uint32_t)(x)) << MSCM_XN_CTRL0_CORE1_D0TCM_DIS_EXEC_SHIFT)) & MSCM_XN_CTRL0_CORE1_D0TCM_DIS_EXEC_MASK)

#define MSCM_XN_CTRL0_CORE2_D0TCM_DIS_EXEC_MASK  (0x400U)
#define MSCM_XN_CTRL0_CORE2_D0TCM_DIS_EXEC_SHIFT (10U)
#define MSCM_XN_CTRL0_CORE2_D0TCM_DIS_EXEC_WIDTH (1U)
#define MSCM_XN_CTRL0_CORE2_D0TCM_DIS_EXEC(x)    (((uint32_t)(((uint32_t)(x)) << MSCM_XN_CTRL0_CORE2_D0TCM_DIS_EXEC_SHIFT)) & MSCM_XN_CTRL0_CORE2_D0TCM_DIS_EXEC_MASK)

#define MSCM_XN_CTRL0_CORE3_D0TCM_DIS_EXEC_MASK  (0x800U)
#define MSCM_XN_CTRL0_CORE3_D0TCM_DIS_EXEC_SHIFT (11U)
#define MSCM_XN_CTRL0_CORE3_D0TCM_DIS_EXEC_WIDTH (1U)
#define MSCM_XN_CTRL0_CORE3_D0TCM_DIS_EXEC(x)    (((uint32_t)(((uint32_t)(x)) << MSCM_XN_CTRL0_CORE3_D0TCM_DIS_EXEC_SHIFT)) & MSCM_XN_CTRL0_CORE3_D0TCM_DIS_EXEC_MASK)

#define MSCM_XN_CTRL0_CORE0_D1TCM_DIS_EXEC_MASK  (0x1000U)
#define MSCM_XN_CTRL0_CORE0_D1TCM_DIS_EXEC_SHIFT (12U)
#define MSCM_XN_CTRL0_CORE0_D1TCM_DIS_EXEC_WIDTH (1U)
#define MSCM_XN_CTRL0_CORE0_D1TCM_DIS_EXEC(x)    (((uint32_t)(((uint32_t)(x)) << MSCM_XN_CTRL0_CORE0_D1TCM_DIS_EXEC_SHIFT)) & MSCM_XN_CTRL0_CORE0_D1TCM_DIS_EXEC_MASK)

#define MSCM_XN_CTRL0_CORE1_D1TCM_DIS_EXEC_MASK  (0x2000U)
#define MSCM_XN_CTRL0_CORE1_D1TCM_DIS_EXEC_SHIFT (13U)
#define MSCM_XN_CTRL0_CORE1_D1TCM_DIS_EXEC_WIDTH (1U)
#define MSCM_XN_CTRL0_CORE1_D1TCM_DIS_EXEC(x)    (((uint32_t)(((uint32_t)(x)) << MSCM_XN_CTRL0_CORE1_D1TCM_DIS_EXEC_SHIFT)) & MSCM_XN_CTRL0_CORE1_D1TCM_DIS_EXEC_MASK)

#define MSCM_XN_CTRL0_CORE2_D1TCM_DIS_EXEC_MASK  (0x4000U)
#define MSCM_XN_CTRL0_CORE2_D1TCM_DIS_EXEC_SHIFT (14U)
#define MSCM_XN_CTRL0_CORE2_D1TCM_DIS_EXEC_WIDTH (1U)
#define MSCM_XN_CTRL0_CORE2_D1TCM_DIS_EXEC(x)    (((uint32_t)(((uint32_t)(x)) << MSCM_XN_CTRL0_CORE2_D1TCM_DIS_EXEC_SHIFT)) & MSCM_XN_CTRL0_CORE2_D1TCM_DIS_EXEC_MASK)

#define MSCM_XN_CTRL0_CORE3_D1TCM_DIS_EXEC_MASK  (0x8000U)
#define MSCM_XN_CTRL0_CORE3_D1TCM_DIS_EXEC_SHIFT (15U)
#define MSCM_XN_CTRL0_CORE3_D1TCM_DIS_EXEC_WIDTH (1U)
#define MSCM_XN_CTRL0_CORE3_D1TCM_DIS_EXEC(x)    (((uint32_t)(((uint32_t)(x)) << MSCM_XN_CTRL0_CORE3_D1TCM_DIS_EXEC_SHIFT)) & MSCM_XN_CTRL0_CORE3_D1TCM_DIS_EXEC_MASK)

#define MSCM_XN_CTRL0_CORE0_ITCM_BACKDOOR_ACCESS_MASK (0x10000U)
#define MSCM_XN_CTRL0_CORE0_ITCM_BACKDOOR_ACCESS_SHIFT (16U)
#define MSCM_XN_CTRL0_CORE0_ITCM_BACKDOOR_ACCESS_WIDTH (1U)
#define MSCM_XN_CTRL0_CORE0_ITCM_BACKDOOR_ACCESS(x) (((uint32_t)(((uint32_t)(x)) << MSCM_XN_CTRL0_CORE0_ITCM_BACKDOOR_ACCESS_SHIFT)) & MSCM_XN_CTRL0_CORE0_ITCM_BACKDOOR_ACCESS_MASK)

#define MSCM_XN_CTRL0_CORE1_ITCM_BACKDOOR_ACCESS_MASK (0x20000U)
#define MSCM_XN_CTRL0_CORE1_ITCM_BACKDOOR_ACCESS_SHIFT (17U)
#define MSCM_XN_CTRL0_CORE1_ITCM_BACKDOOR_ACCESS_WIDTH (1U)
#define MSCM_XN_CTRL0_CORE1_ITCM_BACKDOOR_ACCESS(x) (((uint32_t)(((uint32_t)(x)) << MSCM_XN_CTRL0_CORE1_ITCM_BACKDOOR_ACCESS_SHIFT)) & MSCM_XN_CTRL0_CORE1_ITCM_BACKDOOR_ACCESS_MASK)

