zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_MSCM.h
#define MSCM_XN_CTRL0_CORE2_ITCM_BACKDOOR_ACCESS_MASK (0x40000U)
#define MSCM_XN_CTRL0_CORE2_ITCM_BACKDOOR_ACCESS_SHIFT (18U)
#define MSCM_XN_CTRL0_CORE2_ITCM_BACKDOOR_ACCESS_WIDTH (1U)
#define MSCM_XN_CTRL0_CORE2_ITCM_BACKDOOR_ACCESS(x) (((uint32_t)(((uint32_t)(x)) << MSCM_XN_CTRL0_CORE2_ITCM_BACKDOOR_ACCESS_SHIFT)) & MSCM_XN_CTRL0_CORE2_ITCM_BACKDOOR_ACCESS_MASK)

#define MSCM_XN_CTRL0_CORE3_ITCM_BACKDOOR_ACCESS_MASK (0x80000U)
#define MSCM_XN_CTRL0_CORE3_ITCM_BACKDOOR_ACCESS_SHIFT (19U)
#define MSCM_XN_CTRL0_CORE3_ITCM_BACKDOOR_ACCESS_WIDTH (1U)
#define MSCM_XN_CTRL0_CORE3_ITCM_BACKDOOR_ACCESS(x) (((uint32_t)(((uint32_t)(x)) << MSCM_XN_CTRL0_CORE3_ITCM_BACKDOOR_ACCESS_SHIFT)) & MSCM_XN_CTRL0_CORE3_ITCM_BACKDOOR_ACCESS_MASK)

#define MSCM_XN_CTRL0_CORE0_DTCM_BACKDOOR_ACCESS_MASK (0x100000U)
#define MSCM_XN_CTRL0_CORE0_DTCM_BACKDOOR_ACCESS_SHIFT (20U)
#define MSCM_XN_CTRL0_CORE0_DTCM_BACKDOOR_ACCESS_WIDTH (1U)
#define MSCM_XN_CTRL0_CORE0_DTCM_BACKDOOR_ACCESS(x) (((uint32_t)(((uint32_t)(x)) << MSCM_XN_CTRL0_CORE0_DTCM_BACKDOOR_ACCESS_SHIFT)) & MSCM_XN_CTRL0_CORE0_DTCM_BACKDOOR_ACCESS_MASK)

#define MSCM_XN_CTRL0_CORE1_DTCM_BACKDOOR_ACCESS_MASK (0x200000U)
#define MSCM_XN_CTRL0_CORE1_DTCM_BACKDOOR_ACCESS_SHIFT (21U)
#define MSCM_XN_CTRL0_CORE1_DTCM_BACKDOOR_ACCESS_WIDTH (1U)
#define MSCM_XN_CTRL0_CORE1_DTCM_BACKDOOR_ACCESS(x) (((uint32_t)(((uint32_t)(x)) << MSCM_XN_CTRL0_CORE1_DTCM_BACKDOOR_ACCESS_SHIFT)) & MSCM_XN_CTRL0_CORE1_DTCM_BACKDOOR_ACCESS_MASK)

#define MSCM_XN_CTRL0_CORE2_DTCM_BACKDOOR_ACCESS_MASK (0x400000U)
#define MSCM_XN_CTRL0_CORE2_DTCM_BACKDOOR_ACCESS_SHIFT (22U)
#define MSCM_XN_CTRL0_CORE2_DTCM_BACKDOOR_ACCESS_WIDTH (1U)
#define MSCM_XN_CTRL0_CORE2_DTCM_BACKDOOR_ACCESS(x) (((uint32_t)(((uint32_t)(x)) << MSCM_XN_CTRL0_CORE2_DTCM_BACKDOOR_ACCESS_SHIFT)) & MSCM_XN_CTRL0_CORE2_DTCM_BACKDOOR_ACCESS_MASK)

#define MSCM_XN_CTRL0_CORE3_DTCM_BACKDOOR_ACCESS_MASK (0x800000U)
#define MSCM_XN_CTRL0_CORE3_DTCM_BACKDOOR_ACCESS_SHIFT (23U)
#define MSCM_XN_CTRL0_CORE3_DTCM_BACKDOOR_ACCESS_WIDTH (1U)
#define MSCM_XN_CTRL0_CORE3_DTCM_BACKDOOR_ACCESS(x) (((uint32_t)(((uint32_t)(x)) << MSCM_XN_CTRL0_CORE3_DTCM_BACKDOOR_ACCESS_SHIFT)) & MSCM_XN_CTRL0_CORE3_DTCM_BACKDOOR_ACCESS_MASK)

#define MSCM_XN_CTRL0_NEUTRON_ITCM_MASK          (0x1000000U)
#define MSCM_XN_CTRL0_NEUTRON_ITCM_SHIFT         (24U)
#define MSCM_XN_CTRL0_NEUTRON_ITCM_WIDTH         (1U)
#define MSCM_XN_CTRL0_NEUTRON_ITCM(x)            (((uint32_t)(((uint32_t)(x)) << MSCM_XN_CTRL0_NEUTRON_ITCM_SHIFT)) & MSCM_XN_CTRL0_NEUTRON_ITCM_MASK)

#define MSCM_XN_CTRL0_NEUTRON_DTCM_MASK          (0x2000000U)
#define MSCM_XN_CTRL0_NEUTRON_DTCM_SHIFT         (25U)
#define MSCM_XN_CTRL0_NEUTRON_DTCM_WIDTH         (1U)
#define MSCM_XN_CTRL0_NEUTRON_DTCM(x)            (((uint32_t)(((uint32_t)(x)) << MSCM_XN_CTRL0_NEUTRON_DTCM_SHIFT)) & MSCM_XN_CTRL0_NEUTRON_DTCM_MASK)

#define MSCM_XN_CTRL0_NEUTRON_TCM_HDRAM_MASK     (0x4000000U)
#define MSCM_XN_CTRL0_NEUTRON_TCM_HDRAM_SHIFT    (26U)
#define MSCM_XN_CTRL0_NEUTRON_TCM_HDRAM_WIDTH    (1U)
#define MSCM_XN_CTRL0_NEUTRON_TCM_HDRAM(x)       (((uint32_t)(((uint32_t)(x)) << MSCM_XN_CTRL0_NEUTRON_TCM_HDRAM_SHIFT)) & MSCM_XN_CTRL0_NEUTRON_TCM_HDRAM_MASK)

#define MSCM_XN_CTRL0_DSPV_SRAM0_MASK            (0x8000000U)
#define MSCM_XN_CTRL0_DSPV_SRAM0_SHIFT           (27U)
#define MSCM_XN_CTRL0_DSPV_SRAM0_WIDTH           (1U)
#define MSCM_XN_CTRL0_DSPV_SRAM0(x)              (((uint32_t)(((uint32_t)(x)) << MSCM_XN_CTRL0_DSPV_SRAM0_SHIFT)) & MSCM_XN_CTRL0_DSPV_SRAM0_MASK)

#define MSCM_XN_CTRL0_DSPV_SRAM1_MASK            (0x10000000U)
#define MSCM_XN_CTRL0_DSPV_SRAM1_SHIFT           (28U)
#define MSCM_XN_CTRL0_DSPV_SRAM1_WIDTH           (1U)
#define MSCM_XN_CTRL0_DSPV_SRAM1(x)              (((uint32_t)(((uint32_t)(x)) << MSCM_XN_CTRL0_DSPV_SRAM1_SHIFT)) & MSCM_XN_CTRL0_DSPV_SRAM1_MASK)

#define MSCM_XN_CTRL0_DSPV_SRAM2_MASK            (0x20000000U)
#define MSCM_XN_CTRL0_DSPV_SRAM2_SHIFT           (29U)
#define MSCM_XN_CTRL0_DSPV_SRAM2_WIDTH           (1U)
#define MSCM_XN_CTRL0_DSPV_SRAM2(x)              (((uint32_t)(((uint32_t)(x)) << MSCM_XN_CTRL0_DSPV_SRAM2_SHIFT)) & MSCM_XN_CTRL0_DSPV_SRAM2_MASK)

#define MSCM_XN_CTRL0_SLK_MASK                   (0x40000000U)
#define MSCM_XN_CTRL0_SLK_SHIFT                  (30U)
#define MSCM_XN_CTRL0_SLK_WIDTH                  (1U)
#define MSCM_XN_CTRL0_SLK(x)                     (((uint32_t)(((uint32_t)(x)) << MSCM_XN_CTRL0_SLK_SHIFT)) & MSCM_XN_CTRL0_SLK_MASK)

#define MSCM_XN_CTRL0_HLK_MASK                   (0x80000000U)
#define MSCM_XN_CTRL0_HLK_SHIFT                  (31U)
#define MSCM_XN_CTRL0_HLK_WIDTH                  (1U)
#define MSCM_XN_CTRL0_HLK(x)                     (((uint32_t)(((uint32_t)(x)) << MSCM_XN_CTRL0_HLK_SHIFT)) & MSCM_XN_CTRL0_HLK_MASK)
/*! @} */

/*! @name XN_CTRL1 - Memory Execution Control 1 */
/*! @{ */

#define MSCM_XN_CTRL1_LPE_CODE_SRAM_MASK         (0x1U)
#define MSCM_XN_CTRL1_LPE_CODE_SRAM_SHIFT        (0U)
#define MSCM_XN_CTRL1_LPE_CODE_SRAM_WIDTH        (1U)
#define MSCM_XN_CTRL1_LPE_CODE_SRAM(x)           (((uint32_t)(((uint32_t)(x)) << MSCM_XN_CTRL1_LPE_CODE_SRAM_SHIFT)) & MSCM_XN_CTRL1_LPE_CODE_SRAM_MASK)

#define MSCM_XN_CTRL1_LPE_DATA_SRAM_MASK         (0x2U)
#define MSCM_XN_CTRL1_LPE_DATA_SRAM_SHIFT        (1U)
#define MSCM_XN_CTRL1_LPE_DATA_SRAM_WIDTH        (1U)
#define MSCM_XN_CTRL1_LPE_DATA_SRAM(x)           (((uint32_t)(((uint32_t)(x)) << MSCM_XN_CTRL1_LPE_DATA_SRAM_SHIFT)) & MSCM_XN_CTRL1_LPE_DATA_SRAM_MASK)

#define MSCM_XN_CTRL1_CPE_SRAM0_MASK             (0x4U)
#define MSCM_XN_CTRL1_CPE_SRAM0_SHIFT            (2U)
#define MSCM_XN_CTRL1_CPE_SRAM0_WIDTH            (1U)
#define MSCM_XN_CTRL1_CPE_SRAM0(x)               (((uint32_t)(((uint32_t)(x)) << MSCM_XN_CTRL1_CPE_SRAM0_SHIFT)) & MSCM_XN_CTRL1_CPE_SRAM0_MASK)

#define MSCM_XN_CTRL1_CPE_SRAM1_MASK             (0x8U)
#define MSCM_XN_CTRL1_CPE_SRAM1_SHIFT            (3U)
#define MSCM_XN_CTRL1_CPE_SRAM1_WIDTH            (1U)
#define MSCM_XN_CTRL1_CPE_SRAM1(x)               (((uint32_t)(((uint32_t)(x)) << MSCM_XN_CTRL1_CPE_SRAM1_SHIFT)) & MSCM_XN_CTRL1_CPE_SRAM1_MASK)

#define MSCM_XN_CTRL1_CPE_SRAM2_MASK             (0x10U)
#define MSCM_XN_CTRL1_CPE_SRAM2_SHIFT            (4U)
#define MSCM_XN_CTRL1_CPE_SRAM2_WIDTH            (1U)
#define MSCM_XN_CTRL1_CPE_SRAM2(x)               (((uint32_t)(((uint32_t)(x)) << MSCM_XN_CTRL1_CPE_SRAM2_SHIFT)) & MSCM_XN_CTRL1_CPE_SRAM2_MASK)

#define MSCM_XN_CTRL1_CPE_SRAM3_MASK             (0x20U)
#define MSCM_XN_CTRL1_CPE_SRAM3_SHIFT            (5U)
#define MSCM_XN_CTRL1_CPE_SRAM3_WIDTH            (1U)
#define MSCM_XN_CTRL1_CPE_SRAM3(x)               (((uint32_t)(((uint32_t)(x)) << MSCM_XN_CTRL1_CPE_SRAM3_SHIFT)) & MSCM_XN_CTRL1_CPE_SRAM3_MASK)

#define MSCM_XN_CTRL1_CPE_A0TCM_MASK             (0x40U)
#define MSCM_XN_CTRL1_CPE_A0TCM_SHIFT            (6U)
#define MSCM_XN_CTRL1_CPE_A0TCM_WIDTH            (1U)
#define MSCM_XN_CTRL1_CPE_A0TCM(x)               (((uint32_t)(((uint32_t)(x)) << MSCM_XN_CTRL1_CPE_A0TCM_SHIFT)) & MSCM_XN_CTRL1_CPE_A0TCM_MASK)

#define MSCM_XN_CTRL1_CPE_B0TCM_MASK             (0x80U)
#define MSCM_XN_CTRL1_CPE_B0TCM_SHIFT            (7U)
#define MSCM_XN_CTRL1_CPE_B0TCM_WIDTH            (1U)
#define MSCM_XN_CTRL1_CPE_B0TCM(x)               (((uint32_t)(((uint32_t)(x)) << MSCM_XN_CTRL1_CPE_B0TCM_SHIFT)) & MSCM_XN_CTRL1_CPE_B0TCM_MASK)

