zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_MSCM.h
#define MSCM_XN_CTRL1_CPE_C0TCM_MASK             (0x100U)
#define MSCM_XN_CTRL1_CPE_C0TCM_SHIFT            (8U)
#define MSCM_XN_CTRL1_CPE_C0TCM_WIDTH            (1U)
#define MSCM_XN_CTRL1_CPE_C0TCM(x)               (((uint32_t)(((uint32_t)(x)) << MSCM_XN_CTRL1_CPE_C0TCM_SHIFT)) & MSCM_XN_CTRL1_CPE_C0TCM_MASK)

#define MSCM_XN_CTRL1_CPE_A1TCM_MASK             (0x200U)
#define MSCM_XN_CTRL1_CPE_A1TCM_SHIFT            (9U)
#define MSCM_XN_CTRL1_CPE_A1TCM_WIDTH            (1U)
#define MSCM_XN_CTRL1_CPE_A1TCM(x)               (((uint32_t)(((uint32_t)(x)) << MSCM_XN_CTRL1_CPE_A1TCM_SHIFT)) & MSCM_XN_CTRL1_CPE_A1TCM_MASK)

#define MSCM_XN_CTRL1_CPE_B1TCM_MASK             (0x400U)
#define MSCM_XN_CTRL1_CPE_B1TCM_SHIFT            (10U)
#define MSCM_XN_CTRL1_CPE_B1TCM_WIDTH            (1U)
#define MSCM_XN_CTRL1_CPE_B1TCM(x)               (((uint32_t)(((uint32_t)(x)) << MSCM_XN_CTRL1_CPE_B1TCM_SHIFT)) & MSCM_XN_CTRL1_CPE_B1TCM_MASK)

#define MSCM_XN_CTRL1_CPE_C1TCM_MASK             (0x800U)
#define MSCM_XN_CTRL1_CPE_C1TCM_SHIFT            (11U)
#define MSCM_XN_CTRL1_CPE_C1TCM_WIDTH            (1U)
#define MSCM_XN_CTRL1_CPE_C1TCM(x)               (((uint32_t)(((uint32_t)(x)) << MSCM_XN_CTRL1_CPE_C1TCM_SHIFT)) & MSCM_XN_CTRL1_CPE_C1TCM_MASK)

#define MSCM_XN_CTRL1_CPE_LLC0_MASK              (0x1000U)
#define MSCM_XN_CTRL1_CPE_LLC0_SHIFT             (12U)
#define MSCM_XN_CTRL1_CPE_LLC0_WIDTH             (1U)
#define MSCM_XN_CTRL1_CPE_LLC0(x)                (((uint32_t)(((uint32_t)(x)) << MSCM_XN_CTRL1_CPE_LLC0_SHIFT)) & MSCM_XN_CTRL1_CPE_LLC0_MASK)

#define MSCM_XN_CTRL1_CPE_LLC1_MASK              (0x2000U)
#define MSCM_XN_CTRL1_CPE_LLC1_SHIFT             (13U)
#define MSCM_XN_CTRL1_CPE_LLC1_WIDTH             (1U)
#define MSCM_XN_CTRL1_CPE_LLC1(x)                (((uint32_t)(((uint32_t)(x)) << MSCM_XN_CTRL1_CPE_LLC1_SHIFT)) & MSCM_XN_CTRL1_CPE_LLC1_MASK)

#define MSCM_XN_CTRL1_SLK_MASK                   (0x40000000U)
#define MSCM_XN_CTRL1_SLK_SHIFT                  (30U)
#define MSCM_XN_CTRL1_SLK_WIDTH                  (1U)
#define MSCM_XN_CTRL1_SLK(x)                     (((uint32_t)(((uint32_t)(x)) << MSCM_XN_CTRL1_SLK_SHIFT)) & MSCM_XN_CTRL1_SLK_MASK)

#define MSCM_XN_CTRL1_HLK_MASK                   (0x80000000U)
#define MSCM_XN_CTRL1_HLK_SHIFT                  (31U)
#define MSCM_XN_CTRL1_HLK_WIDTH                  (1U)
#define MSCM_XN_CTRL1_HLK(x)                     (((uint32_t)(((uint32_t)(x)) << MSCM_XN_CTRL1_HLK_SHIFT)) & MSCM_XN_CTRL1_HLK_MASK)
/*! @} */

/*! @name PLAT_NMI_CONTROL - Platform NMI Control */
/*! @{ */

#define MSCM_PLAT_NMI_CONTROL_PLT_C0_MASK        (0x1U)
#define MSCM_PLAT_NMI_CONTROL_PLT_C0_SHIFT       (0U)
#define MSCM_PLAT_NMI_CONTROL_PLT_C0_WIDTH       (1U)
#define MSCM_PLAT_NMI_CONTROL_PLT_C0(x)          (((uint32_t)(((uint32_t)(x)) << MSCM_PLAT_NMI_CONTROL_PLT_C0_SHIFT)) & MSCM_PLAT_NMI_CONTROL_PLT_C0_MASK)

#define MSCM_PLAT_NMI_CONTROL_PLT_C1_MASK        (0x2U)
#define MSCM_PLAT_NMI_CONTROL_PLT_C1_SHIFT       (1U)
#define MSCM_PLAT_NMI_CONTROL_PLT_C1_WIDTH       (1U)
#define MSCM_PLAT_NMI_CONTROL_PLT_C1(x)          (((uint32_t)(((uint32_t)(x)) << MSCM_PLAT_NMI_CONTROL_PLT_C1_SHIFT)) & MSCM_PLAT_NMI_CONTROL_PLT_C1_MASK)

#define MSCM_PLAT_NMI_CONTROL_PLT_C2_MASK        (0x4U)
#define MSCM_PLAT_NMI_CONTROL_PLT_C2_SHIFT       (2U)
#define MSCM_PLAT_NMI_CONTROL_PLT_C2_WIDTH       (1U)
#define MSCM_PLAT_NMI_CONTROL_PLT_C2(x)          (((uint32_t)(((uint32_t)(x)) << MSCM_PLAT_NMI_CONTROL_PLT_C2_SHIFT)) & MSCM_PLAT_NMI_CONTROL_PLT_C2_MASK)

#define MSCM_PLAT_NMI_CONTROL_PLT_C3_MASK        (0x8U)
#define MSCM_PLAT_NMI_CONTROL_PLT_C3_SHIFT       (3U)
#define MSCM_PLAT_NMI_CONTROL_PLT_C3_WIDTH       (1U)
#define MSCM_PLAT_NMI_CONTROL_PLT_C3(x)          (((uint32_t)(((uint32_t)(x)) << MSCM_PLAT_NMI_CONTROL_PLT_C3_SHIFT)) & MSCM_PLAT_NMI_CONTROL_PLT_C3_MASK)

#define MSCM_PLAT_NMI_CONTROL_SLK_MASK           (0x40000000U)
#define MSCM_PLAT_NMI_CONTROL_SLK_SHIFT          (30U)
#define MSCM_PLAT_NMI_CONTROL_SLK_WIDTH          (1U)
#define MSCM_PLAT_NMI_CONTROL_SLK(x)             (((uint32_t)(((uint32_t)(x)) << MSCM_PLAT_NMI_CONTROL_SLK_SHIFT)) & MSCM_PLAT_NMI_CONTROL_SLK_MASK)

#define MSCM_PLAT_NMI_CONTROL_HLK_MASK           (0x80000000U)
#define MSCM_PLAT_NMI_CONTROL_HLK_SHIFT          (31U)
#define MSCM_PLAT_NMI_CONTROL_HLK_WIDTH          (1U)
#define MSCM_PLAT_NMI_CONTROL_HLK(x)             (((uint32_t)(((uint32_t)(x)) << MSCM_PLAT_NMI_CONTROL_HLK_SHIFT)) & MSCM_PLAT_NMI_CONTROL_HLK_MASK)
/*! @} */

/*! @name LPE_NMI_CONTROL - LPE NMI Control */
/*! @{ */

#define MSCM_LPE_NMI_CONTROL_LPE_C0_MASK         (0x1U)
#define MSCM_LPE_NMI_CONTROL_LPE_C0_SHIFT        (0U)
#define MSCM_LPE_NMI_CONTROL_LPE_C0_WIDTH        (1U)
#define MSCM_LPE_NMI_CONTROL_LPE_C0(x)           (((uint32_t)(((uint32_t)(x)) << MSCM_LPE_NMI_CONTROL_LPE_C0_SHIFT)) & MSCM_LPE_NMI_CONTROL_LPE_C0_MASK)

#define MSCM_LPE_NMI_CONTROL_SLK_MASK            (0x40000000U)
#define MSCM_LPE_NMI_CONTROL_SLK_SHIFT           (30U)
#define MSCM_LPE_NMI_CONTROL_SLK_WIDTH           (1U)
#define MSCM_LPE_NMI_CONTROL_SLK(x)              (((uint32_t)(((uint32_t)(x)) << MSCM_LPE_NMI_CONTROL_SLK_SHIFT)) & MSCM_LPE_NMI_CONTROL_SLK_MASK)

#define MSCM_LPE_NMI_CONTROL_HLK_MASK            (0x80000000U)
#define MSCM_LPE_NMI_CONTROL_HLK_SHIFT           (31U)
#define MSCM_LPE_NMI_CONTROL_HLK_WIDTH           (1U)
#define MSCM_LPE_NMI_CONTROL_HLK(x)              (((uint32_t)(((uint32_t)(x)) << MSCM_LPE_NMI_CONTROL_HLK_SHIFT)) & MSCM_LPE_NMI_CONTROL_HLK_MASK)
/*! @} */

/*! @name CPE_NMI_CONTROL - CPE NMI Control */
/*! @{ */

#define MSCM_CPE_NMI_CONTROL_CPE_C0_MASK         (0x1U)
#define MSCM_CPE_NMI_CONTROL_CPE_C0_SHIFT        (0U)
#define MSCM_CPE_NMI_CONTROL_CPE_C0_WIDTH        (1U)
#define MSCM_CPE_NMI_CONTROL_CPE_C0(x)           (((uint32_t)(((uint32_t)(x)) << MSCM_CPE_NMI_CONTROL_CPE_C0_SHIFT)) & MSCM_CPE_NMI_CONTROL_CPE_C0_MASK)

#define MSCM_CPE_NMI_CONTROL_CPE_C1_MASK         (0x2U)
#define MSCM_CPE_NMI_CONTROL_CPE_C1_SHIFT        (1U)
#define MSCM_CPE_NMI_CONTROL_CPE_C1_WIDTH        (1U)
#define MSCM_CPE_NMI_CONTROL_CPE_C1(x)           (((uint32_t)(((uint32_t)(x)) << MSCM_CPE_NMI_CONTROL_CPE_C1_SHIFT)) & MSCM_CPE_NMI_CONTROL_CPE_C1_MASK)

#define MSCM_CPE_NMI_CONTROL_SLK_MASK            (0x40000000U)
#define MSCM_CPE_NMI_CONTROL_SLK_SHIFT           (30U)
#define MSCM_CPE_NMI_CONTROL_SLK_WIDTH           (1U)
#define MSCM_CPE_NMI_CONTROL_SLK(x)              (((uint32_t)(((uint32_t)(x)) << MSCM_CPE_NMI_CONTROL_SLK_SHIFT)) & MSCM_CPE_NMI_CONTROL_SLK_MASK)

#define MSCM_CPE_NMI_CONTROL_HLK_MASK            (0x80000000U)
#define MSCM_CPE_NMI_CONTROL_HLK_SHIFT           (31U)
#define MSCM_CPE_NMI_CONTROL_HLK_WIDTH           (1U)
#define MSCM_CPE_NMI_CONTROL_HLK(x)              (((uint32_t)(((uint32_t)(x)) << MSCM_CPE_NMI_CONTROL_HLK_SHIFT)) & MSCM_CPE_NMI_CONTROL_HLK_MASK)
/*! @} */

/*! @name ENEDC - Enable Interconnect Error Detection */
/*! @{ */

