zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_MSCM.h
#define MSCM_ENEDC_PBR1_DATA_CHK_MASK            (0x1U)
#define MSCM_ENEDC_PBR1_DATA_CHK_SHIFT           (0U)
#define MSCM_ENEDC_PBR1_DATA_CHK_WIDTH           (1U)
#define MSCM_ENEDC_PBR1_DATA_CHK(x)              (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_PBR1_DATA_CHK_SHIFT)) & MSCM_ENEDC_PBR1_DATA_CHK_MASK)

#define MSCM_ENEDC_PBR1_ADD_CHK_MASK             (0x2U)
#define MSCM_ENEDC_PBR1_ADD_CHK_SHIFT            (1U)
#define MSCM_ENEDC_PBR1_ADD_CHK_WIDTH            (1U)
#define MSCM_ENEDC_PBR1_ADD_CHK(x)               (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_PBR1_ADD_CHK_SHIFT)) & MSCM_ENEDC_PBR1_ADD_CHK_MASK)

#define MSCM_ENEDC_PBR2_DATA_CHK_MASK            (0x4U)
#define MSCM_ENEDC_PBR2_DATA_CHK_SHIFT           (2U)
#define MSCM_ENEDC_PBR2_DATA_CHK_WIDTH           (1U)
#define MSCM_ENEDC_PBR2_DATA_CHK(x)              (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_PBR2_DATA_CHK_SHIFT)) & MSCM_ENEDC_PBR2_DATA_CHK_MASK)

#define MSCM_ENEDC_PBR2_ADD_CHK_MASK             (0x8U)
#define MSCM_ENEDC_PBR2_ADD_CHK_SHIFT            (3U)
#define MSCM_ENEDC_PBR2_ADD_CHK_WIDTH            (1U)
#define MSCM_ENEDC_PBR2_ADD_CHK(x)               (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_PBR2_ADD_CHK_SHIFT)) & MSCM_ENEDC_PBR2_ADD_CHK_MASK)

#define MSCM_ENEDC_PBR3_DATA_CHK_MASK            (0x10U)
#define MSCM_ENEDC_PBR3_DATA_CHK_SHIFT           (4U)
#define MSCM_ENEDC_PBR3_DATA_CHK_WIDTH           (1U)
#define MSCM_ENEDC_PBR3_DATA_CHK(x)              (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_PBR3_DATA_CHK_SHIFT)) & MSCM_ENEDC_PBR3_DATA_CHK_MASK)

#define MSCM_ENEDC_PBR3_ADD_CHK_MASK             (0x20U)
#define MSCM_ENEDC_PBR3_ADD_CHK_SHIFT            (5U)
#define MSCM_ENEDC_PBR3_ADD_CHK_WIDTH            (1U)
#define MSCM_ENEDC_PBR3_ADD_CHK(x)               (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_PBR3_ADD_CHK_SHIFT)) & MSCM_ENEDC_PBR3_ADD_CHK_MASK)

#define MSCM_ENEDC_PBR4_DATA_CHK_MASK            (0x40U)
#define MSCM_ENEDC_PBR4_DATA_CHK_SHIFT           (6U)
#define MSCM_ENEDC_PBR4_DATA_CHK_WIDTH           (1U)
#define MSCM_ENEDC_PBR4_DATA_CHK(x)              (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_PBR4_DATA_CHK_SHIFT)) & MSCM_ENEDC_PBR4_DATA_CHK_MASK)

#define MSCM_ENEDC_PBR4_ADD_CHK_MASK             (0x80U)
#define MSCM_ENEDC_PBR4_ADD_CHK_SHIFT            (7U)
#define MSCM_ENEDC_PBR4_ADD_CHK_WIDTH            (1U)
#define MSCM_ENEDC_PBR4_ADD_CHK(x)               (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_PBR4_ADD_CHK_SHIFT)) & MSCM_ENEDC_PBR4_ADD_CHK_MASK)

#define MSCM_ENEDC_PBR5_DATA_CHK_MASK            (0x100U)
#define MSCM_ENEDC_PBR5_DATA_CHK_SHIFT           (8U)
#define MSCM_ENEDC_PBR5_DATA_CHK_WIDTH           (1U)
#define MSCM_ENEDC_PBR5_DATA_CHK(x)              (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_PBR5_DATA_CHK_SHIFT)) & MSCM_ENEDC_PBR5_DATA_CHK_MASK)

#define MSCM_ENEDC_PBR5_ADD_CHK_MASK             (0x200U)
#define MSCM_ENEDC_PBR5_ADD_CHK_SHIFT            (9U)
#define MSCM_ENEDC_PBR5_ADD_CHK_WIDTH            (1U)
#define MSCM_ENEDC_PBR5_ADD_CHK(x)               (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_PBR5_ADD_CHK_SHIFT)) & MSCM_ENEDC_PBR5_ADD_CHK_MASK)

#define MSCM_ENEDC_AXBS_AUX0_ADD_CHK_MASK        (0x400U)
#define MSCM_ENEDC_AXBS_AUX0_ADD_CHK_SHIFT       (10U)
#define MSCM_ENEDC_AXBS_AUX0_ADD_CHK_WIDTH       (1U)
#define MSCM_ENEDC_AXBS_AUX0_ADD_CHK(x)          (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_AXBS_AUX0_ADD_CHK_SHIFT)) & MSCM_ENEDC_AXBS_AUX0_ADD_CHK_MASK)

#define MSCM_ENEDC_AXBS_AUX0_WR_CHK_MASK         (0x800U)
#define MSCM_ENEDC_AXBS_AUX0_WR_CHK_SHIFT        (11U)
#define MSCM_ENEDC_AXBS_AUX0_WR_CHK_WIDTH        (1U)
#define MSCM_ENEDC_AXBS_AUX0_WR_CHK(x)           (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_AXBS_AUX0_WR_CHK_SHIFT)) & MSCM_ENEDC_AXBS_AUX0_WR_CHK_MASK)

#define MSCM_ENEDC_AXBS_CORE0_ADD_CHK_MASK       (0x1000U)
#define MSCM_ENEDC_AXBS_CORE0_ADD_CHK_SHIFT      (12U)
#define MSCM_ENEDC_AXBS_CORE0_ADD_CHK_WIDTH      (1U)
#define MSCM_ENEDC_AXBS_CORE0_ADD_CHK(x)         (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_AXBS_CORE0_ADD_CHK_SHIFT)) & MSCM_ENEDC_AXBS_CORE0_ADD_CHK_MASK)

#define MSCM_ENEDC_AXBS_CORE0_WR_CHK_MASK        (0x2000U)
#define MSCM_ENEDC_AXBS_CORE0_WR_CHK_SHIFT       (13U)
#define MSCM_ENEDC_AXBS_CORE0_WR_CHK_WIDTH       (1U)
#define MSCM_ENEDC_AXBS_CORE0_WR_CHK(x)          (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_AXBS_CORE0_WR_CHK_SHIFT)) & MSCM_ENEDC_AXBS_CORE0_WR_CHK_MASK)

#define MSCM_ENEDC_AXBS_CORE1_ADD_CHK_MASK       (0x4000U)
#define MSCM_ENEDC_AXBS_CORE1_ADD_CHK_SHIFT      (14U)
#define MSCM_ENEDC_AXBS_CORE1_ADD_CHK_WIDTH      (1U)
#define MSCM_ENEDC_AXBS_CORE1_ADD_CHK(x)         (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_AXBS_CORE1_ADD_CHK_SHIFT)) & MSCM_ENEDC_AXBS_CORE1_ADD_CHK_MASK)

#define MSCM_ENEDC_AXBS_CORE1_WR_CHK_MASK        (0x8000U)
#define MSCM_ENEDC_AXBS_CORE1_WR_CHK_SHIFT       (15U)
#define MSCM_ENEDC_AXBS_CORE1_WR_CHK_WIDTH       (1U)
#define MSCM_ENEDC_AXBS_CORE1_WR_CHK(x)          (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_AXBS_CORE1_WR_CHK_SHIFT)) & MSCM_ENEDC_AXBS_CORE1_WR_CHK_MASK)

#define MSCM_ENEDC_AXBS_CORE2_ADD_CHK_MASK       (0x10000U)
#define MSCM_ENEDC_AXBS_CORE2_ADD_CHK_SHIFT      (16U)
#define MSCM_ENEDC_AXBS_CORE2_ADD_CHK_WIDTH      (1U)
#define MSCM_ENEDC_AXBS_CORE2_ADD_CHK(x)         (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_AXBS_CORE2_ADD_CHK_SHIFT)) & MSCM_ENEDC_AXBS_CORE2_ADD_CHK_MASK)

#define MSCM_ENEDC_AXBS_CORE2_WR_CHK_MASK        (0x20000U)
#define MSCM_ENEDC_AXBS_CORE2_WR_CHK_SHIFT       (17U)
#define MSCM_ENEDC_AXBS_CORE2_WR_CHK_WIDTH       (1U)
#define MSCM_ENEDC_AXBS_CORE2_WR_CHK(x)          (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_AXBS_CORE2_WR_CHK_SHIFT)) & MSCM_ENEDC_AXBS_CORE2_WR_CHK_MASK)

#define MSCM_ENEDC_AXBS_CORE3_ADD_CHK_MASK       (0x40000U)
#define MSCM_ENEDC_AXBS_CORE3_ADD_CHK_SHIFT      (18U)
#define MSCM_ENEDC_AXBS_CORE3_ADD_CHK_WIDTH      (1U)
#define MSCM_ENEDC_AXBS_CORE3_ADD_CHK(x)         (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_AXBS_CORE3_ADD_CHK_SHIFT)) & MSCM_ENEDC_AXBS_CORE3_ADD_CHK_MASK)

#define MSCM_ENEDC_AXBS_CORE3_WR_CHK_MASK        (0x80000U)
#define MSCM_ENEDC_AXBS_CORE3_WR_CHK_SHIFT       (19U)
#define MSCM_ENEDC_AXBS_CORE3_WR_CHK_WIDTH       (1U)
#define MSCM_ENEDC_AXBS_CORE3_WR_CHK(x)          (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_AXBS_CORE3_WR_CHK_SHIFT)) & MSCM_ENEDC_AXBS_CORE3_WR_CHK_MASK)

