zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_MSCM.h
#define MSCM_ENEDC_DSPV_SLV_ADD_CHK_MASK         (0x100000U)
#define MSCM_ENEDC_DSPV_SLV_ADD_CHK_SHIFT        (20U)
#define MSCM_ENEDC_DSPV_SLV_ADD_CHK_WIDTH        (1U)
#define MSCM_ENEDC_DSPV_SLV_ADD_CHK(x)           (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_DSPV_SLV_ADD_CHK_SHIFT)) & MSCM_ENEDC_DSPV_SLV_ADD_CHK_MASK)

#define MSCM_ENEDC_DSPV_SLV_WR_CHK_MASK          (0x200000U)
#define MSCM_ENEDC_DSPV_SLV_WR_CHK_SHIFT         (21U)
#define MSCM_ENEDC_DSPV_SLV_WR_CHK_WIDTH         (1U)
#define MSCM_ENEDC_DSPV_SLV_WR_CHK(x)            (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_DSPV_SLV_WR_CHK_SHIFT)) & MSCM_ENEDC_DSPV_SLV_WR_CHK_MASK)

#define MSCM_ENEDC_LPE_SLV_ADD_CHK_MASK          (0x400000U)
#define MSCM_ENEDC_LPE_SLV_ADD_CHK_SHIFT         (22U)
#define MSCM_ENEDC_LPE_SLV_ADD_CHK_WIDTH         (1U)
#define MSCM_ENEDC_LPE_SLV_ADD_CHK(x)            (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_LPE_SLV_ADD_CHK_SHIFT)) & MSCM_ENEDC_LPE_SLV_ADD_CHK_MASK)

#define MSCM_ENEDC_LPE_SLV_WR_CHK_MASK           (0x800000U)
#define MSCM_ENEDC_LPE_SLV_WR_CHK_SHIFT          (23U)
#define MSCM_ENEDC_LPE_SLV_WR_CHK_WIDTH          (1U)
#define MSCM_ENEDC_LPE_SLV_WR_CHK(x)             (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_LPE_SLV_WR_CHK_SHIFT)) & MSCM_ENEDC_LPE_SLV_WR_CHK_MASK)

#define MSCM_ENEDC_LPE_S1_ADD_CHK_MASK           (0x1000000U)
#define MSCM_ENEDC_LPE_S1_ADD_CHK_SHIFT          (24U)
#define MSCM_ENEDC_LPE_S1_ADD_CHK_WIDTH          (1U)
#define MSCM_ENEDC_LPE_S1_ADD_CHK(x)             (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_LPE_S1_ADD_CHK_SHIFT)) & MSCM_ENEDC_LPE_S1_ADD_CHK_MASK)

#define MSCM_ENEDC_LPE_S1_WR_CHK_MASK            (0x2000000U)
#define MSCM_ENEDC_LPE_S1_WR_CHK_SHIFT           (25U)
#define MSCM_ENEDC_LPE_S1_WR_CHK_WIDTH           (1U)
#define MSCM_ENEDC_LPE_S1_WR_CHK(x)              (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_LPE_S1_WR_CHK_SHIFT)) & MSCM_ENEDC_LPE_S1_WR_CHK_MASK)

#define MSCM_ENEDC_LPE_S0_ADD_CHK_MASK           (0x4000000U)
#define MSCM_ENEDC_LPE_S0_ADD_CHK_SHIFT          (26U)
#define MSCM_ENEDC_LPE_S0_ADD_CHK_WIDTH          (1U)
#define MSCM_ENEDC_LPE_S0_ADD_CHK(x)             (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_LPE_S0_ADD_CHK_SHIFT)) & MSCM_ENEDC_LPE_S0_ADD_CHK_MASK)

#define MSCM_ENEDC_LPE_S0_WR_CHK_MASK            (0x8000000U)
#define MSCM_ENEDC_LPE_S0_WR_CHK_SHIFT           (27U)
#define MSCM_ENEDC_LPE_S0_WR_CHK_WIDTH           (1U)
#define MSCM_ENEDC_LPE_S0_WR_CHK(x)              (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_LPE_S0_WR_CHK_SHIFT)) & MSCM_ENEDC_LPE_S0_WR_CHK_MASK)

#define MSCM_ENEDC_LMEM_BKD_S2_ADD_CHK_MASK      (0x10000000U)
#define MSCM_ENEDC_LMEM_BKD_S2_ADD_CHK_SHIFT     (28U)
#define MSCM_ENEDC_LMEM_BKD_S2_ADD_CHK_WIDTH     (1U)
#define MSCM_ENEDC_LMEM_BKD_S2_ADD_CHK(x)        (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_LMEM_BKD_S2_ADD_CHK_SHIFT)) & MSCM_ENEDC_LMEM_BKD_S2_ADD_CHK_MASK)

#define MSCM_ENEDC_LMEM_BKD_S2_WR_CHK_MASK       (0x20000000U)
#define MSCM_ENEDC_LMEM_BKD_S2_WR_CHK_SHIFT      (29U)
#define MSCM_ENEDC_LMEM_BKD_S2_WR_CHK_WIDTH      (1U)
#define MSCM_ENEDC_LMEM_BKD_S2_WR_CHK(x)         (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_LMEM_BKD_S2_WR_CHK_SHIFT)) & MSCM_ENEDC_LMEM_BKD_S2_WR_CHK_MASK)
/*! @} */

/*! @name ENEDC1 - Enable Interconnect Error Detection */
/*! @{ */

#define MSCM_ENEDC1_CM7_0_AHBP_MASK              (0x1U)
#define MSCM_ENEDC1_CM7_0_AHBP_SHIFT             (0U)
#define MSCM_ENEDC1_CM7_0_AHBP_WIDTH             (1U)
#define MSCM_ENEDC1_CM7_0_AHBP(x)                (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC1_CM7_0_AHBP_SHIFT)) & MSCM_ENEDC1_CM7_0_AHBP_MASK)

#define MSCM_ENEDC1_CM7_1_AHBP_MASK              (0x2U)
#define MSCM_ENEDC1_CM7_1_AHBP_SHIFT             (1U)
#define MSCM_ENEDC1_CM7_1_AHBP_WIDTH             (1U)
#define MSCM_ENEDC1_CM7_1_AHBP(x)                (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC1_CM7_1_AHBP_SHIFT)) & MSCM_ENEDC1_CM7_1_AHBP_MASK)

#define MSCM_ENEDC1_CM7_2_AHBP_MASK              (0x4U)
#define MSCM_ENEDC1_CM7_2_AHBP_SHIFT             (2U)
#define MSCM_ENEDC1_CM7_2_AHBP_WIDTH             (1U)
#define MSCM_ENEDC1_CM7_2_AHBP(x)                (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC1_CM7_2_AHBP_SHIFT)) & MSCM_ENEDC1_CM7_2_AHBP_MASK)

#define MSCM_ENEDC1_CM7_3_AHBP_MASK              (0x8U)
#define MSCM_ENEDC1_CM7_3_AHBP_SHIFT             (3U)
#define MSCM_ENEDC1_CM7_3_AHBP_WIDTH             (1U)
#define MSCM_ENEDC1_CM7_3_AHBP(x)                (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC1_CM7_3_AHBP_SHIFT)) & MSCM_ENEDC1_CM7_3_AHBP_MASK)

#define MSCM_ENEDC1_ACE_M0_MASK                  (0x10U)
#define MSCM_ENEDC1_ACE_M0_SHIFT                 (4U)
#define MSCM_ENEDC1_ACE_M0_WIDTH                 (1U)
#define MSCM_ENEDC1_ACE_M0(x)                    (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC1_ACE_M0_SHIFT)) & MSCM_ENEDC1_ACE_M0_MASK)

#define MSCM_ENEDC1_ACE_M1_MASK                  (0x20U)
#define MSCM_ENEDC1_ACE_M1_SHIFT                 (5U)
#define MSCM_ENEDC1_ACE_M1_WIDTH                 (1U)
#define MSCM_ENEDC1_ACE_M1(x)                    (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC1_ACE_M1_SHIFT)) & MSCM_ENEDC1_ACE_M1_MASK)

#define MSCM_ENEDC1_AXI_ACC_PORT_MASK            (0x40U)
#define MSCM_ENEDC1_AXI_ACC_PORT_SHIFT           (6U)
#define MSCM_ENEDC1_AXI_ACC_PORT_WIDTH           (1U)
#define MSCM_ENEDC1_AXI_ACC_PORT(x)              (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC1_AXI_ACC_PORT_SHIFT)) & MSCM_ENEDC1_AXI_ACC_PORT_MASK)

#define MSCM_ENEDC1_HSE2_MASK                    (0x80U)
#define MSCM_ENEDC1_HSE2_SHIFT                   (7U)
#define MSCM_ENEDC1_HSE2_WIDTH                   (1U)
#define MSCM_ENEDC1_HSE2(x)                      (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC1_HSE2_SHIFT)) & MSCM_ENEDC1_HSE2_MASK)

#define MSCM_ENEDC1_DSPV_MASTER_MASK             (0x100U)
#define MSCM_ENEDC1_DSPV_MASTER_SHIFT            (8U)
#define MSCM_ENEDC1_DSPV_MASTER_WIDTH            (1U)
#define MSCM_ENEDC1_DSPV_MASTER(x)               (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC1_DSPV_MASTER_SHIFT)) & MSCM_ENEDC1_DSPV_MASTER_MASK)

