zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_MSCM.h
#define MSCM_ENEDC1_TCM_AXBS_MASK                (0x200U)
#define MSCM_ENEDC1_TCM_AXBS_SHIFT               (9U)
#define MSCM_ENEDC1_TCM_AXBS_WIDTH               (1U)
#define MSCM_ENEDC1_TCM_AXBS(x)                  (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC1_TCM_AXBS_SHIFT)) & MSCM_ENEDC1_TCM_AXBS_MASK)

#define MSCM_ENEDC1_LPE_MASTER_MASK              (0x400U)
#define MSCM_ENEDC1_LPE_MASTER_SHIFT             (10U)
#define MSCM_ENEDC1_LPE_MASTER_WIDTH             (1U)
#define MSCM_ENEDC1_LPE_MASTER(x)                (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC1_LPE_MASTER_SHIFT)) & MSCM_ENEDC1_LPE_MASTER_MASK)

#define MSCM_ENEDC1_LPE_M0_MASK                  (0x800U)
#define MSCM_ENEDC1_LPE_M0_SHIFT                 (11U)
#define MSCM_ENEDC1_LPE_M0_WIDTH                 (1U)
#define MSCM_ENEDC1_LPE_M0(x)                    (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC1_LPE_M0_SHIFT)) & MSCM_ENEDC1_LPE_M0_MASK)

#define MSCM_ENEDC1_LMEM_C_MASK                  (0x1000U)
#define MSCM_ENEDC1_LMEM_C_SHIFT                 (12U)
#define MSCM_ENEDC1_LMEM_C_WIDTH                 (1U)
#define MSCM_ENEDC1_LMEM_C(x)                    (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC1_LMEM_C_SHIFT)) & MSCM_ENEDC1_LMEM_C_MASK)

#define MSCM_ENEDC1_LMEM_S_MASK                  (0x2000U)
#define MSCM_ENEDC1_LMEM_S_SHIFT                 (13U)
#define MSCM_ENEDC1_LMEM_S_WIDTH                 (1U)
#define MSCM_ENEDC1_LMEM_S(x)                    (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC1_LMEM_S_SHIFT)) & MSCM_ENEDC1_LMEM_S_MASK)

#define MSCM_ENEDC1_LPE_DMA_MASK                 (0x4000U)
#define MSCM_ENEDC1_LPE_DMA_SHIFT                (14U)
#define MSCM_ENEDC1_LPE_DMA_WIDTH                (1U)
#define MSCM_ENEDC1_LPE_DMA(x)                   (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC1_LPE_DMA_SHIFT)) & MSCM_ENEDC1_LPE_DMA_MASK)

#define MSCM_ENEDC1_PERIPH_AXBS_MASK             (0x8000U)
#define MSCM_ENEDC1_PERIPH_AXBS_SHIFT            (15U)
#define MSCM_ENEDC1_PERIPH_AXBS_WIDTH            (1U)
#define MSCM_ENEDC1_PERIPH_AXBS(x)               (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC1_PERIPH_AXBS_SHIFT)) & MSCM_ENEDC1_PERIPH_AXBS_MASK)
/*! @} */

/*! @name IAHBCFGREG - AHB Gasket Configuration */
/*! @{ */

#define MSCM_IAHBCFGREG_CM7_0_AHBP_MASK          (0x1U)
#define MSCM_IAHBCFGREG_CM7_0_AHBP_SHIFT         (0U)
#define MSCM_IAHBCFGREG_CM7_0_AHBP_WIDTH         (1U)
#define MSCM_IAHBCFGREG_CM7_0_AHBP(x)            (((uint32_t)(((uint32_t)(x)) << MSCM_IAHBCFGREG_CM7_0_AHBP_SHIFT)) & MSCM_IAHBCFGREG_CM7_0_AHBP_MASK)

#define MSCM_IAHBCFGREG_CM7_1_AHBP_MASK          (0x2U)
#define MSCM_IAHBCFGREG_CM7_1_AHBP_SHIFT         (1U)
#define MSCM_IAHBCFGREG_CM7_1_AHBP_WIDTH         (1U)
#define MSCM_IAHBCFGREG_CM7_1_AHBP(x)            (((uint32_t)(((uint32_t)(x)) << MSCM_IAHBCFGREG_CM7_1_AHBP_SHIFT)) & MSCM_IAHBCFGREG_CM7_1_AHBP_MASK)

#define MSCM_IAHBCFGREG_CM7_2_AHBP_MASK          (0x4U)
#define MSCM_IAHBCFGREG_CM7_2_AHBP_SHIFT         (2U)
#define MSCM_IAHBCFGREG_CM7_2_AHBP_WIDTH         (1U)
#define MSCM_IAHBCFGREG_CM7_2_AHBP(x)            (((uint32_t)(((uint32_t)(x)) << MSCM_IAHBCFGREG_CM7_2_AHBP_SHIFT)) & MSCM_IAHBCFGREG_CM7_2_AHBP_MASK)

#define MSCM_IAHBCFGREG_CM7_3_AHBP_MASK          (0x8U)
#define MSCM_IAHBCFGREG_CM7_3_AHBP_SHIFT         (3U)
#define MSCM_IAHBCFGREG_CM7_3_AHBP_WIDTH         (1U)
#define MSCM_IAHBCFGREG_CM7_3_AHBP(x)            (((uint32_t)(((uint32_t)(x)) << MSCM_IAHBCFGREG_CM7_3_AHBP_SHIFT)) & MSCM_IAHBCFGREG_CM7_3_AHBP_MASK)

#define MSCM_IAHBCFGREG_PBR1_DIS_OPT_MASK        (0x10U)
#define MSCM_IAHBCFGREG_PBR1_DIS_OPT_SHIFT       (4U)
#define MSCM_IAHBCFGREG_PBR1_DIS_OPT_WIDTH       (1U)
#define MSCM_IAHBCFGREG_PBR1_DIS_OPT(x)          (((uint32_t)(((uint32_t)(x)) << MSCM_IAHBCFGREG_PBR1_DIS_OPT_SHIFT)) & MSCM_IAHBCFGREG_PBR1_DIS_OPT_MASK)

#define MSCM_IAHBCFGREG_PBR2_DIS_OPT_MASK        (0x20U)
#define MSCM_IAHBCFGREG_PBR2_DIS_OPT_SHIFT       (5U)
#define MSCM_IAHBCFGREG_PBR2_DIS_OPT_WIDTH       (1U)
#define MSCM_IAHBCFGREG_PBR2_DIS_OPT(x)          (((uint32_t)(((uint32_t)(x)) << MSCM_IAHBCFGREG_PBR2_DIS_OPT_SHIFT)) & MSCM_IAHBCFGREG_PBR2_DIS_OPT_MASK)

#define MSCM_IAHBCFGREG_PBR3_DIS_OPT_MASK        (0x40U)
#define MSCM_IAHBCFGREG_PBR3_DIS_OPT_SHIFT       (6U)
#define MSCM_IAHBCFGREG_PBR3_DIS_OPT_WIDTH       (1U)
#define MSCM_IAHBCFGREG_PBR3_DIS_OPT(x)          (((uint32_t)(((uint32_t)(x)) << MSCM_IAHBCFGREG_PBR3_DIS_OPT_SHIFT)) & MSCM_IAHBCFGREG_PBR3_DIS_OPT_MASK)

#define MSCM_IAHBCFGREG_PBR4_DIS_OPT_MASK        (0x80U)
#define MSCM_IAHBCFGREG_PBR4_DIS_OPT_SHIFT       (7U)
#define MSCM_IAHBCFGREG_PBR4_DIS_OPT_WIDTH       (1U)
#define MSCM_IAHBCFGREG_PBR4_DIS_OPT(x)          (((uint32_t)(((uint32_t)(x)) << MSCM_IAHBCFGREG_PBR4_DIS_OPT_SHIFT)) & MSCM_IAHBCFGREG_PBR4_DIS_OPT_MASK)

#define MSCM_IAHBCFGREG_PBR5_DIS_OPT_MASK        (0x100U)
#define MSCM_IAHBCFGREG_PBR5_DIS_OPT_SHIFT       (8U)
#define MSCM_IAHBCFGREG_PBR5_DIS_OPT_WIDTH       (1U)
#define MSCM_IAHBCFGREG_PBR5_DIS_OPT(x)          (((uint32_t)(((uint32_t)(x)) << MSCM_IAHBCFGREG_PBR5_DIS_OPT_SHIFT)) & MSCM_IAHBCFGREG_PBR5_DIS_OPT_MASK)

#define MSCM_IAHBCFGREG_PERIPH_TO_AXBS_AUX0_MASK (0x200U)
#define MSCM_IAHBCFGREG_PERIPH_TO_AXBS_AUX0_SHIFT (9U)
#define MSCM_IAHBCFGREG_PERIPH_TO_AXBS_AUX0_WIDTH (1U)
#define MSCM_IAHBCFGREG_PERIPH_TO_AXBS_AUX0(x)   (((uint32_t)(((uint32_t)(x)) << MSCM_IAHBCFGREG_PERIPH_TO_AXBS_AUX0_SHIFT)) & MSCM_IAHBCFGREG_PERIPH_TO_AXBS_AUX0_MASK)

#define MSCM_IAHBCFGREG_CORE0_AHBS_MASK          (0x400U)
#define MSCM_IAHBCFGREG_CORE0_AHBS_SHIFT         (10U)
#define MSCM_IAHBCFGREG_CORE0_AHBS_WIDTH         (1U)
#define MSCM_IAHBCFGREG_CORE0_AHBS(x)            (((uint32_t)(((uint32_t)(x)) << MSCM_IAHBCFGREG_CORE0_AHBS_SHIFT)) & MSCM_IAHBCFGREG_CORE0_AHBS_MASK)

#define MSCM_IAHBCFGREG_CORE1_AHBS_MASK          (0x800U)
#define MSCM_IAHBCFGREG_CORE1_AHBS_SHIFT         (11U)
#define MSCM_IAHBCFGREG_CORE1_AHBS_WIDTH         (1U)
#define MSCM_IAHBCFGREG_CORE1_AHBS(x)            (((uint32_t)(((uint32_t)(x)) << MSCM_IAHBCFGREG_CORE1_AHBS_SHIFT)) & MSCM_IAHBCFGREG_CORE1_AHBS_MASK)

#define MSCM_IAHBCFGREG_CORE2_AHBS_MASK          (0x1000U)
#define MSCM_IAHBCFGREG_CORE2_AHBS_SHIFT         (12U)
#define MSCM_IAHBCFGREG_CORE2_AHBS_WIDTH         (1U)
#define MSCM_IAHBCFGREG_CORE2_AHBS(x)            (((uint32_t)(((uint32_t)(x)) << MSCM_IAHBCFGREG_CORE2_AHBS_SHIFT)) & MSCM_IAHBCFGREG_CORE2_AHBS_MASK)

#define MSCM_IAHBCFGREG_CORE3_AHBS_MASK          (0x2000U)
#define MSCM_IAHBCFGREG_CORE3_AHBS_SHIFT         (13U)
#define MSCM_IAHBCFGREG_CORE3_AHBS_WIDTH         (1U)
#define MSCM_IAHBCFGREG_CORE3_AHBS(x)            (((uint32_t)(((uint32_t)(x)) << MSCM_IAHBCFGREG_CORE3_AHBS_SHIFT)) & MSCM_IAHBCFGREG_CORE3_AHBS_MASK)

#define MSCM_IAHBCFGREG_NIC_TO_PER_XBAR_MASK     (0x4000U)
#define MSCM_IAHBCFGREG_NIC_TO_PER_XBAR_SHIFT    (14U)
#define MSCM_IAHBCFGREG_NIC_TO_PER_XBAR_WIDTH    (1U)
#define MSCM_IAHBCFGREG_NIC_TO_PER_XBAR(x)       (((uint32_t)(((uint32_t)(x)) << MSCM_IAHBCFGREG_NIC_TO_PER_XBAR_SHIFT)) & MSCM_IAHBCFGREG_NIC_TO_PER_XBAR_MASK)

