zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_MSCM.h
#define MSCM_IAHBCFGREG_XSPI_DIS_OPT_MASK        (0x8000U)
#define MSCM_IAHBCFGREG_XSPI_DIS_OPT_SHIFT       (15U)
#define MSCM_IAHBCFGREG_XSPI_DIS_OPT_WIDTH       (1U)
#define MSCM_IAHBCFGREG_XSPI_DIS_OPT(x)          (((uint32_t)(((uint32_t)(x)) << MSCM_IAHBCFGREG_XSPI_DIS_OPT_SHIFT)) & MSCM_IAHBCFGREG_XSPI_DIS_OPT_MASK)

#define MSCM_IAHBCFGREG_LPE_DIS_OPT_MASK         (0x10000U)
#define MSCM_IAHBCFGREG_LPE_DIS_OPT_SHIFT        (16U)
#define MSCM_IAHBCFGREG_LPE_DIS_OPT_WIDTH        (1U)
#define MSCM_IAHBCFGREG_LPE_DIS_OPT(x)           (((uint32_t)(((uint32_t)(x)) << MSCM_IAHBCFGREG_LPE_DIS_OPT_SHIFT)) & MSCM_IAHBCFGREG_LPE_DIS_OPT_MASK)

#define MSCM_IAHBCFGREG_DSPV_MSTR_MASK           (0x20000U)
#define MSCM_IAHBCFGREG_DSPV_MSTR_SHIFT          (17U)
#define MSCM_IAHBCFGREG_DSPV_MSTR_WIDTH          (1U)
#define MSCM_IAHBCFGREG_DSPV_MSTR(x)             (((uint32_t)(((uint32_t)(x)) << MSCM_IAHBCFGREG_DSPV_MSTR_SHIFT)) & MSCM_IAHBCFGREG_DSPV_MSTR_MASK)

#define MSCM_IAHBCFGREG_DSPV_SLV_MASK            (0x40000U)
#define MSCM_IAHBCFGREG_DSPV_SLV_SHIFT           (18U)
#define MSCM_IAHBCFGREG_DSPV_SLV_WIDTH           (1U)
#define MSCM_IAHBCFGREG_DSPV_SLV(x)              (((uint32_t)(((uint32_t)(x)) << MSCM_IAHBCFGREG_DSPV_SLV_SHIFT)) & MSCM_IAHBCFGREG_DSPV_SLV_MASK)

#define MSCM_IAHBCFGREG_HSE2_MASK                (0x80000U)
#define MSCM_IAHBCFGREG_HSE2_SHIFT               (19U)
#define MSCM_IAHBCFGREG_HSE2_WIDTH               (1U)
#define MSCM_IAHBCFGREG_HSE2(x)                  (((uint32_t)(((uint32_t)(x)) << MSCM_IAHBCFGREG_HSE2_SHIFT)) & MSCM_IAHBCFGREG_HSE2_MASK)

#define MSCM_IAHBCFGREG_ACE_ACCEL_M0_MASK        (0x100000U)
#define MSCM_IAHBCFGREG_ACE_ACCEL_M0_SHIFT       (20U)
#define MSCM_IAHBCFGREG_ACE_ACCEL_M0_WIDTH       (1U)
#define MSCM_IAHBCFGREG_ACE_ACCEL_M0(x)          (((uint32_t)(((uint32_t)(x)) << MSCM_IAHBCFGREG_ACE_ACCEL_M0_SHIFT)) & MSCM_IAHBCFGREG_ACE_ACCEL_M0_MASK)

#define MSCM_IAHBCFGREG_ACE_ACCEL_M1_MASK        (0x200000U)
#define MSCM_IAHBCFGREG_ACE_ACCEL_M1_SHIFT       (21U)
#define MSCM_IAHBCFGREG_ACE_ACCEL_M1_WIDTH       (1U)
#define MSCM_IAHBCFGREG_ACE_ACCEL_M1(x)          (((uint32_t)(((uint32_t)(x)) << MSCM_IAHBCFGREG_ACE_ACCEL_M1_SHIFT)) & MSCM_IAHBCFGREG_ACE_ACCEL_M1_MASK)
/*! @} */

/*! @name IRSPRC_CM_DSPV - Interrupt Router Shared Peripheral Control for the Cortex-M7, Cortex-M4, and DSPV Cores */
/*! @{ */

#define MSCM_IRSPRC_CM_DSPV_M7_0_MASK            (0x1U)
#define MSCM_IRSPRC_CM_DSPV_M7_0_SHIFT           (0U)
#define MSCM_IRSPRC_CM_DSPV_M7_0_WIDTH           (1U)
#define MSCM_IRSPRC_CM_DSPV_M7_0(x)              (((uint16_t)(((uint16_t)(x)) << MSCM_IRSPRC_CM_DSPV_M7_0_SHIFT)) & MSCM_IRSPRC_CM_DSPV_M7_0_MASK)

#define MSCM_IRSPRC_CM_DSPV_M7_1_MASK            (0x2U)
#define MSCM_IRSPRC_CM_DSPV_M7_1_SHIFT           (1U)
#define MSCM_IRSPRC_CM_DSPV_M7_1_WIDTH           (1U)
#define MSCM_IRSPRC_CM_DSPV_M7_1(x)              (((uint16_t)(((uint16_t)(x)) << MSCM_IRSPRC_CM_DSPV_M7_1_SHIFT)) & MSCM_IRSPRC_CM_DSPV_M7_1_MASK)

#define MSCM_IRSPRC_CM_DSPV_M7_2_MASK            (0x4U)
#define MSCM_IRSPRC_CM_DSPV_M7_2_SHIFT           (2U)
#define MSCM_IRSPRC_CM_DSPV_M7_2_WIDTH           (1U)
#define MSCM_IRSPRC_CM_DSPV_M7_2(x)              (((uint16_t)(((uint16_t)(x)) << MSCM_IRSPRC_CM_DSPV_M7_2_SHIFT)) & MSCM_IRSPRC_CM_DSPV_M7_2_MASK)

#define MSCM_IRSPRC_CM_DSPV_M7_3_MASK            (0x8U)
#define MSCM_IRSPRC_CM_DSPV_M7_3_SHIFT           (3U)
#define MSCM_IRSPRC_CM_DSPV_M7_3_WIDTH           (1U)
#define MSCM_IRSPRC_CM_DSPV_M7_3(x)              (((uint16_t)(((uint16_t)(x)) << MSCM_IRSPRC_CM_DSPV_M7_3_SHIFT)) & MSCM_IRSPRC_CM_DSPV_M7_3_MASK)

#define MSCM_IRSPRC_CM_DSPV_LPE_CORE_MASK        (0x10U)
#define MSCM_IRSPRC_CM_DSPV_LPE_CORE_SHIFT       (4U)
#define MSCM_IRSPRC_CM_DSPV_LPE_CORE_WIDTH       (1U)
#define MSCM_IRSPRC_CM_DSPV_LPE_CORE(x)          (((uint16_t)(((uint16_t)(x)) << MSCM_IRSPRC_CM_DSPV_LPE_CORE_SHIFT)) & MSCM_IRSPRC_CM_DSPV_LPE_CORE_MASK)

#define MSCM_IRSPRC_CM_DSPV_DSPV_MASK            (0x20U)
#define MSCM_IRSPRC_CM_DSPV_DSPV_SHIFT           (5U)
#define MSCM_IRSPRC_CM_DSPV_DSPV_WIDTH           (1U)
#define MSCM_IRSPRC_CM_DSPV_DSPV(x)              (((uint16_t)(((uint16_t)(x)) << MSCM_IRSPRC_CM_DSPV_DSPV_SHIFT)) & MSCM_IRSPRC_CM_DSPV_DSPV_MASK)

#define MSCM_IRSPRC_CM_DSPV_LOCK_MASK            (0x8000U)
#define MSCM_IRSPRC_CM_DSPV_LOCK_SHIFT           (15U)
#define MSCM_IRSPRC_CM_DSPV_LOCK_WIDTH           (1U)
#define MSCM_IRSPRC_CM_DSPV_LOCK(x)              (((uint16_t)(((uint16_t)(x)) << MSCM_IRSPRC_CM_DSPV_LOCK_SHIFT)) & MSCM_IRSPRC_CM_DSPV_LOCK_MASK)
/*! @} */

/*! @name IRSPRC_CPE - Interrupt Router Shared Peripheral Routing Control for CPE Cores */
/*! @{ */

#define MSCM_IRSPRC_CPE_CPE_CORE_MASK            (0x1U)
#define MSCM_IRSPRC_CPE_CPE_CORE_SHIFT           (0U)
#define MSCM_IRSPRC_CPE_CPE_CORE_WIDTH           (1U)
#define MSCM_IRSPRC_CPE_CPE_CORE(x)              (((uint16_t)(((uint16_t)(x)) << MSCM_IRSPRC_CPE_CPE_CORE_SHIFT)) & MSCM_IRSPRC_CPE_CPE_CORE_MASK)

#define MSCM_IRSPRC_CPE_LOCK_MASK                (0x8000U)
#define MSCM_IRSPRC_CPE_LOCK_SHIFT               (15U)
#define MSCM_IRSPRC_CPE_LOCK_WIDTH               (1U)
#define MSCM_IRSPRC_CPE_LOCK(x)                  (((uint16_t)(((uint16_t)(x)) << MSCM_IRSPRC_CPE_LOCK_SHIFT)) & MSCM_IRSPRC_CPE_LOCK_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group MSCM_Register_Masks */

/*!
 * @}
 */ /* end of group MSCM_Peripheral_Access_Layer */

#endif  /* #if !defined(S32K566_MSCM_H_) */
